#调用abs绝对值函数：必须是数字型参数，参数个数1个
print(abs(100));
print(abs(-20));
print(abs(12.34));

#传入参数个数必须是正确的
#abs(1, 2) #默认不报错，运行时报错

#传入的参数类型，要正确
#print(abs('a')); #默认不报错，运行时报错

#-------------------------------------------------------
#调用max最大值函数：必须是数字型参数，参数个数不限
print(max(1, 2));
print(max(2, 3, 1, -5));

#--------------------------------------------------------
#数据类型转换 int() 必须是数字字符的参数，参数个数1个
print(int('123'));

#--------------------------------------------------------
#转为float()
print(float('12.34'));
#print(int('12.34')); #会报错，只能转为浮点型

#----------------------------------------------------------
#转为str()
print(str(1.23));
print(str(100));

#----------------------------------------------------------
#转为bool() 
print(bool(1));
print(bool(''));
print(bool(0));

#----------------------------------------------------------
#给函数起别名
a = abs # 变量a指向abs函数
print(a(-1)) # 所以也可以通过a调用abs函数

#----------------------------------------------------------
#hex() 整数转十六进制字符串
print(hex(150));

#计算平方根
import math
print(math.sqrt(2));

